Revit 2026 API

# UIControlledApplication Properties

---

The UIControlledApplication type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ActiveAddInId |  |
|  | ControlledApplication | Returns the database level ControlledApplication represented by this UI-level ControlledApplication. |
|  | IsLateAddinLoading | Indicates whether this add-in is loaded on the fly or not. If it is loaded when Revit is starting up, it is false, otherwise it should be true. |
|  | IsViewerModeActive | Identifies if the current Revit session is running in Viewer mode |
|  | LoadedApplications |  |
|  | MainWindowHandle |  |
|  | ProductIsRS |  |

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace